<?php
// +----------------------------------------------------------------------
// | Think_firdot
// +----------------------------------------------------------------------
// | 版权所有 2008~2017 上海泛多网络技术有限公司 [ http://www.firdot.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://think.firdot.com
// +----------------------------------------------------------------------

return [
	'prefix' => '', // cookie 名称前缀
	'expire' => 0, // cookie 保存时间
	'path' => '/', // cookie 保存路径
	'domain' => '', // cookie 有效域名
	'secure' => true, // cookie 启用安全传输
	'httponly' => '', // httponly设置
	'setcookie' => true, // 是否使用 setcookie
];
