<?php
// +----------------------------------------------------------------------
// | Think_firdot
// +----------------------------------------------------------------------
// | 版权所有 2008~2017 上海泛多网络技术有限公司 [ http://www.firdot.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://think.firdot.com
// +----------------------------------------------------------------------

return [
	'type' => 'File', // 日志记录方式，内置 file socket 支持扩展
	'path' => '', // 日志保存目录
	'level' => [], // 日志记录级别
	'single' => false, // 单文件日志写入
	'apart_level' => ['emergency', 'alert', 'critical', 'error', 'sql'], // 独立日志级别
	'max_files' => 0, // 最大日志文件数量
	'close' => false, // 是否关闭日志写入
];
